In [1]:
# """What is Data?
# Raw, unprocessed facts, figures, or symbols
# Types-
# Structured Data
# Unstructured Data
# Semi-structured Data
# Quantitative Data
# Qualitative

# Methods of data Collection

# -Surveys and"""

In [2]:
import sqlite3

conn = sqlite3.connect('DBIBatch2024.db')

In [3]:
cursor = conn.cursor()
cursor.execute('''CREATE TABLE IF NOT EXISTS users(
id INTEGER PRIMARY KEY,
name TEXT,
age INTEGER
)
''')


# Insert into table
cursor.execute("insert into users(name,age) values ('Omkar',23)")
cursor.execute("insert into users(name,age) values ('Daksh',21)")
cursor.execute("insert into users(name,age) values ('Ram',25)")
cursor.execute("insert into users(name,age) values ('Kunal',27)")

conn.commit

In [4]:
# Query for orbder by

cursor.execute("select * from users order by age desc")
row = cursor.fetchall()

print(row)

[(4, 'Kunal', 27), (3, 'Ram', 25), (1, 'Omkar', 23), (2, 'Daksh', 21)]

In [5]:
# Query for group by

cursor.execute("select age, count(*) as count from users group by age")
row = cursor.fetchall()

print(row)

[(21, 1), (23, 1), (25, 1), (27, 1)]

In [6]:
# update
cursor.execute("update users set name ='waghmare' where age = 23")
cursor.execute("select * from users")
row = cursor.fetchall()

print(row)

[(1, 'waghmare', 23), (2, 'Daksh', 21), (3, 'Ram', 25), (4, 'Kunal', 27)]

In [7]:
#
cursor.execute("select * from users where name like 'Omkar'")
row = cursor.fetchall()
print(row)
conn.close

[]

# Assignment 1 Basic Database operation

In [8]:
# OPERATION_SELECT = 'select'
# OPERATION_CREATE = 'create'
# OPERATION_UPDATE = 'update'
# OPERATION_DLETE = 'delete'


def query_master(query, dbName):
        try:
            conn1 = sqlite3.connect(dbName)
            conn1.execute("PRAGMA foreign_keys = 1")
            cursor1 = conn1.cursor() 
            result = cursor1.execute(query)
            conn1.commit()
            return result
        except ValueError:
            print("Invalid input! Please enter a number.")
        finally:
            cursor1.close()
            conn.close()

In [9]:
conn1 = sqlite3.connect('school.db')
cursor1 = conn1.cursor()
cursor1.execute('''CREATE TABLE IF NOT EXISTS student(
id INTEGER PRIMARY KEY,
name TEXT,
age INTEGER,
grade text
)
''')

In [10]:
cursor1.execute('''CREATE TABLE IF NOT EXISTS courses(
course_id INTEGER PRIMARY KEY,
course_name TEXT,
instructor text
)
''')

conn1.commit()

In [11]:
cursor1.execute("insert into student(name,age,grade) values ('Omkar',23,'A')")
cursor1.execute("insert into student(name,age,grade) values ('Daksh',21,'A')")
cursor1.execute("insert into student(name,age,grade) values ('Ram',25,'A')")
cursor1.execute("insert into student(name,age,grade) values ('Kunal',27,'A')")
cursor1.execute("insert into student(name,age,grade) values ('makrand',23,'A')")

cursor1.execute("insert into courses(course_name,instructor) values ('python','anjali')")
cursor1.execute("insert into courses(course_name,instructor) values ('maths','sajida')")
cursor1.execute("insert into courses(course_name,instructor) values ('ml','atul')")

In [12]:
cursor1.execute("select * from student where grade = 'A'")

rows = cursor1.fetchall()
for row in rows:
    print(row)

(1, 'Omkar', 23, 'A')
(2, 'Daksh', 21, 'A')
(3, 'Ram', 25, 'A')
(4, 'Kunal', 27, 'A')
(5, 'makrand', 23, 'A')

In [13]:
cursor1.execute("select course_name, instructor from courses order by course_name asc")
rows = cursor1.fetchall()
for row in rows:
    print(row)

('maths', 'sajida')
('ml', 'atul')
('python', 'anjali')

In [14]:
# update data
cursor1.execute("update student set grade ='B' where name ='Daksh'")
cursor1.execute("select * from student where grade = 'A'")
rows = cursor1.fetchall()
for row in rows:
    print(row)

(1, 'Omkar', 23, 'A')
(3, 'Ram', 25, 'A')
(4, 'Kunal', 27, 'A')
(5, 'makrand', 23, 'A')

In [15]:
cursor1.execute("update courses set instructor ='sanjay' where course_id = 2")
cursor1.execute("select * from courses")
rows = cursor1.fetchall()
for row in rows:
    print(row)

(1, 'python', 'anjali')
(2, 'maths', 'sanjay')
(3, 'ml', 'atul')

In [16]:
# Delete records
cursor1.execute("delete from student where id =2")
cursor1.execute("select * from courses")
rows = cursor1.fetchall()
for row in rows:
    print(row)

(1, 'python', 'anjali')
(2, 'maths', 'sanjay')
(3, 'ml', 'atul')

In [17]:
cursor1.execute("drop table student")
cursor1.execute("drop table courses")
# cursor1.execute("Show tables")

In [18]:
# cursor1.execute("drop table student")
cursor1.execute("select * from sqlite_master where type='table' ")
result = cursor1.fetchall()

result

[]

# Constraints- primary key and Foreign key

In [19]:
dept_db = 'emp_dept_db.db'


dept_table = '''CREATE TABLE IF NOT EXISTS dept(
dept_id INTEGER PRIMARY KEY,
dept_name TEXT not null
)
'''
emp_table = '''CREATE TABLE IF NOT EXISTS emp(
emp_id INTEGER PRIMARY KEY,
emp_name TEXT not null,
dept_id INTEGER,
FOREIGN KEY(dept_id) REFERENCES dept(dept_id)
)
'''
query_master(dept_table,dept_db)
query_master(emp_table,dept_db)

# Creating the indexs

insert = '''create index if not exists idx_emp_name on emp(emp_name)'''
cursor1.execute(insert)
insert = '''create index if not exists idx_dept_name on dept(dept_name)'''
cursor1.execute(insert)



# insert data into dept

insert = '''insert into dept(dept_name) values ('Human Resources')'''
cursor1.execute(insert)
insert = '''insert into dept(dept_name) values ('Engineering')'''
cursor1.execute(insert)
insert = '''insert into dept(dept_name) values ('Sales')'''
cursor1.execute(insert)

# query = '''select * from emp'''

# conn1 = sqlite3.connect(dept_db)
# cursor1 = conn1.cursor() 
# result = cursor1.execute(query)
# for row in result:
#     print(row)

OperationalError: no such table: main.emp

In [ ]:
# insert data into emp
insert = '''insert into emp(emp_name, dept_id) values ('Omkar', 1)'''
query_master(insert,dept_db)

insert = '''insert into emp(emp_name, dept_id) values ('Daksh', 2)'''
query_master(insert,dept_db)

insert = '''insert into emp(emp_name, dept_id) values ('Ram', 1)'''
query_master(insert,dept_db)

insert = '''insert into emp(emp_name, dept_id) values ('Kunal', 2)'''
query_master(insert,dept_db)

# Select the data of emp

# query = '''select emp_id, emp_name, dept_id from emp'''
# query_master(query,OPERATION_UPDATE)

# result = query_master()

In [ ]:

stu_db = 'stu_db.db'

sub_table = '''CREATE TABLE IF NOT EXISTS subjects(
sub_id INTEGER PRIMARY KEY,
sub_name TEXT not null
)
'''
stu_table = '''CREATE TABLE IF NOT EXISTS students(
stu_id INTEGER PRIMARY KEY,
stu_name TEXT not null,
sub_id INTEGER,
stu_marks INTEGER,
FOREIGN KEY(sub_id) REFERENCES sub(sub_id)
)
'''
query_master(sub_table,stu_db)
query_master(stu_table,stu_db)

In [ ]:
insert = '''create index if not exists idx_emp_name on emp(emp_name)'''
query_master(insert,stu_db)
insert = '''create index if not exists idx_dept_name on dept(dept_name)'''
query_master(insert,stu_db)

insert = '''insert into students(stu_name, sub_id, stu_marks) values ('Ram', 1, 50)'''
query_master(insert,stu_db)
insert = '''insert into students(stu_name, sub_id, stu_marks) values ('Daksh', 2, 60)'''
query_master(insert,stu_db)
insert = '''insert into students(stu_name, sub_id, stu_marks) values ('Omkar', 3, 70)'''
query_master(insert,stu_db)
insert = '''insert into students(stu_name, sub_id, stu_marks) values ('Kunal', 1, 80)'''
query_master(insert,stu_db)
insert = '''insert into students(stu_name, sub_id, stu_marks) values ('Dhruv', 2, 80)'''
query_master(insert,stu_db)
insert = '''insert into students(stu_name, sub_id, stu_marks) values ('Harsh', 3, 75)'''
query_master(insert,stu_db)


insert = '''insert into subjects(sub_name) values ('DAI')'''
query_master(insert,stu_db)
insert = '''insert into subjects(sub_name) values ('DITISS')'''
query_master(insert,stu_db)
insert = '''insert into subjects(sub_name) values ('DBDA')'''
query_master(insert,stu_db)
insert = '''insert into subjects(sub_name) values ('DIOT')'''
query_master(insert,stu_db)

In [ ]:


query = '''select students.stu_name, subject.sub_name, students.marks from subject join subject on subject.sub_id = students.sub_id '''
result = query_master(query,OPERATION_SELECT,stu_db)
result